        IDENTIFICATION DIVISION.
		PROGRAM-ID.
		    ALUNO01.
		AUTHOR.
			PHILIPP.
		***************************************
		*    MEU PRIMEIRO PROGRAMA            *
		***************************************
		*
		ENVIRONMENT DIVISION.
		*
		DATA DIVISION.
		*
		PROCEDURE DIVISION.
		UNICA SECTION.
		INICIO.
			DISPLAY 'MEU PRIMEIRO PROGRAMA'.
			STOP RUN.