       IDENTIFICATION DIVISION.
	   PROGRAM-ID.
	       ALUNO08.
	   AUTHOR.
	       PHILIPP.
	  ***************************************
	  *    LER E EXIBIR ARQUIVO CLIENTES    *
	  ***************************************
	  *
	   ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	       SELECT ARQ-CLIENTES ASSIGN TO CLIENTES
		       FILE STATUS IS WK-FS-CLIENTES.
	  *
	   DATA DIVISION.
	   FILE SECTION.
	   FD   ARQ-CLIENTES
	        RECORDING MODE IS F.
	   01  REQ-CLIENTES.
	       05 FD-AGENCIA-CLIENTES     PIC X(4).
		   05 FD-CONTA-CLIENTES       PIC 9(5).
		   05 FD-NOME-CLIENTES        PIC A(20).
		   05 FD-SALDO-CLIENTES       PIC 9(6)V99.
	   WORKING-STORAGE SECTION.
	   77  WK-FS-CLIENTES  PIC XX           VALUE SPACES.
	   77  WK-SALDO-EDIT   PIC ZZZ.ZZ9,99   VALUE ZEROS.
	  *
	   PROCEDURE DIVISION.
	   000-PRINCIPAL SECTION.
	   001-PRINCIPAL.
	       PERFORM 101-INICIAR.
		   PERFORM 201-PROCESSAR UNTIL WK-FS-CLIENTES = '10'.
		   PERFORM 901-FINALIZAR.
		   STOP RUN.
	  ***************************************	   
	   100-INICIAR SECTION.
	   101-INICIAR.
	       OPEN INPUT ARQ-CLIENTES.
		   EVALUATE WK-FS-CLIENTES
		       WHEN '00'
			       PERFORM 301-LER-CLIENTES
			   WHEN '35'
				   DISPLAY 'ARQUIVO CLIENTES NAO ENCONTRADO'
				   MOVE 12 TO RETURN-CODE
				   STOP RUN
			   WHEN OTHER
			       DISPLAY 'ERRO ' WK-FS-CLIENTES
				           ' NO COMANDO OPEN CLIENTES'
				   MOVE 12 TO RETURN-CODE
				   STOP RUN
		   END-EVALUATE.
	  ***************************************
	   200-PROCESSAR SECTION.
	   201-PROCESSAR.
	       DISPLAY 'AGENCIA : ' FD-AGENCIA-CLIENTES.
		   DISPLAY 'CONTA   : ' FD-CONTA-CLIENTES.
		   DISPLAY 'NOME    : ' FD-NOME-CLIENTES.
		   MOVE FD-SALDO-CLIENTES TO WK-SALDO-EDIT.
		   DISPLAY 'SALDO   : ' WK-SALDO-EDIT.
		   DISPLAY ' '.
		   PERFORM 301-LER-CLIENTES.
	  ***************************************
	   300-LER-CLIENTES SECTION.
	   301-LER-CLIENTES.
	       READ ARQ-CLIENTES.
		   EVALUATE WK-FS-CLIENTES
		       WHEN '00'
			       CONTINUE
			   WHEN '10'
			       DISPLAY 'FIM DO ARQUIVO'
			   WHEN OTHER
			       DISPLAY 'ERRO ' WK-FS-CLIENTES
				           ' NO COMANDO READ CLIENTES'
				   MOVE 12 TO RETURN-CODE
				   STOP RUN
           END-EVALUATE.		
      ***************************************
       900-FINALIZAR SECTION.
       901-FINALIZAR.
	       CLOSE ARQ-CLIENTES.