       IDENTIFICATION DIVISION.
	   PROGRAM-ID.
	       ALUNO14.
	   AUTHOR.
	       PHILIPP.
	  ****************************************************
	  *    EXIBIR MES E DIA DA SEMANA POR EXTENSO        *
	  ****************************************************
	  *
	   ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
	   SPECIAL-NAMES.
	       DECIMAL-POINT IS COMMA.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	  *
	   DATA DIVISION.
	   FILE SECTION.
	   WORKING-STORAGE SECTION.
	   01  WK-DATA-ACCEPT.
	       05 WK-ANO-ACCEPT        PIC 99    VALUE ZEROS.
		   05 WK-MES-ACCEPT        PIC 99    VALUE ZEROS.
		   05 WK-DIA-ACCEPT        PIC 99    VALUE ZEROS.
	   77  WK-DIASEM-ACCEPT        PIC 9     VALUE ZEROS.
	   01  WK-AREA-COM.
	       05 WK-COD-MES-COM       PIC 99    VALUE ZEROS.
		   05 WK-COD-DIASEM-COM    PIC 9     VALUE ZEROS.
		   05 WK-NOME-MES-COM      PIC X(9)  VALUE ZEROS.
		   05 WK-NOME-DIASEM-COM   PIC X(13) VALUE SPACES.
	   77  WK-NOME-PROG            PIC X(8)  VALUE SPACES.
	  *
	   PROCEDURE DIVISION.
	   000-PRINCIPAL SECTION.
	   001-PRINCIPAL.
	       PERFORM 101-INICIAR.
		   PERFORM 201-PROCESSAR.
		   PERFORM 901-FINALIZAR.
		   STOP RUN.
	  ***************************************	   
	   100-INICIAR SECTION.
	   101-INICIAR.
	       ACCEPT WK-DATA-ACCEPT FROM DATE.
		   ACCEPT WK-DIASEM-ACCEPT FROM DAY-OF-WEEK.
	  ***************************************
	   200-PROCESSAR SECTION.
	   201-PROCESSAR.
	       MOVE WK-MES-ACCEPT  TO WK-COD-MES-COM.
		   MOVE WK-DIASEM-ACCEPT  TO WK-COD-DIASEM-COM.
		   MOVE 'ALUNO15'  TO WK-NOME-PROG.
		   CALL WK-NOME-PROG USING WK-AREA-COM.
	  ***************************************
       900-FINALIZAR SECTION.
       901-FINALIZAR.
	       DISPLAY 'DIA : '   WK-DIA-ACCEPT.
		   DISPLAY 'MES : '   WK-NOME-MES-COM.
		   DISPLAY 'ANO : 20' WK-ANO-ACCEPT.
		   DISPLAY 'DIA DA SEMANA : ' WK-NOME-DIASEM-COM.