//EAD316CB JOB 'EAD316',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//************************************************************
//*  NOME  = SEU PROGRAMA                                    *
//*  LIB1  = SEU CHAVE                                       *
//*  NAME  - SEU PROGRAMA                                    *
//************************************************************
// JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.EAD316,NOME='NOMEPROGRAMA',LIB2=GR.GERAL
//LKED.SYSIN    DD   *
  NAME NOMEPROGRAMA(R)
/*  