//EAD316CL JOB 'EAD316',CLASS=C,MSGCLASS=X,NOTIFY=EAD316,TIME=(0,10)
//*****************************************************
//*      RESGATE DE DIVIDA                            *
//*****************************************************
//EXECUTE  EXEC PGM=ALUNO04
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSIN    DD   *
001000000
0040000
100