//EAD316CL JOB 'EAD316',CLASS=C,MSGCLASS=X,NOTIFY=EAD316,TIME=(0,10)
//*****************************************************
//*      EXECUTAR ALUNO01                             *
//*****************************************************
//EXECUTE  EXEC PGM=ALUNO01
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR