//EAD316CL JOB 'EAD316',CLASS=C,MSGCLASS=X,NOTIFY=EAD316,TIME=(0,10)
//*************************************************
//*      RESOLVER EXTENSO                         *
//*************************************************
//EXECUTE  EXEC PGM=ALUNO14
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR