//EAD316CL JOB 'EAD316',CLASS=C,MSGCLASS=X,NOTIFY=EAD316,TIME=(0,10)
//*****************************************************
//*      OPERACOES ARITMETICAS                        *
//*****************************************************
//EXECUTE  EXEC PGM=ALUNO03
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSIN    DD   *
885
443
17
05